Revit 2026 API

# DirectShapeOptions Class

---

This class is used to control behavior of a DirectShape object.

SystemObject Autodesk.Revit.DBDirectShapeOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DirectShapeOptions : IDisposable
```
```vb
Public Class DirectShapeOptions
	Implements IDisposable
```
```cpp
public ref class DirectShapeOptions : IDisposable
```
```fsharp
type DirectShapeOptions =
    class
        interface IDisposable
    end
```

The DirectShapeOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ReferencingOption | Whether or not the geometry stored in a DirectShape object may be referenced. |
|  | RoomBoundingOption | Identifies whether the DirectShape supports an option for the "Room Bounding" parameter to permit participation in room boundary calculations. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DirectShapeOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Use Enable/Disable functions to change the default behavior. Use DirectShape.SetOptions to modify that object's behavior.

#### Reference

Autodesk.Revit.DB Namespace